jokes = '''Объявление.

Для испытаний очередной партии опытных автомобилей автозаводу требуется очередная партия опытных водителей.

* * *
Решил мужик в кино сходить. Купил три бутылки водки, а когда пришел — оказалось, что он перепутал время начала на 30 минут. Заходит в зал, там темно и ничего не видно. Он пошел свое место искать (7 ряд 14 место). Подходит к первому попавшемуся креслу:

— Парнишь, какой это ряд?

— Девятый.

Идет дальше.

— Женщина, у вас какой ряд?

— Седьмой.

Ряд свой нашел, теперь ищет место.

— У вас какое место?

— Шестое.

Подходит к следующему:

— У вас какое место?

— Пятнадцатое.

Садится рядом, достает первую бутылку и обращается к соседу слева:

— Мужик, пить будешь?

— Нет спасибо мне нельзя — язва желудка.

Поворачивается к соседу справа:

— Мужик, пить будешь?

— Нет.

— А баба твоя?

— Это не моя баба.

Кричит вперед:

— Лы-сы-й, пить будешь?!

— Нет, не буду.

Выпивает бутылку один, достает другую и спрашивает у тех же:

— Мужик, пить будешь?

— Я же сказал, что не буду — у меня язва!

— Мужик, пить будешь?

— Нет, я же говорил!

— А баба твоя?

— Не моя это баба!

— Лы-сы-й пить будешь?!

— Нет, не буду!

Пришлось ему в одиночку и вторую выпить, после чего достал третью и снова:

— Мужик, пить будешь?

— Да отстань ты от меня, у меня язва!

— Мужик, пить будешь?

— Ты, что придурок что ли? Сказал же, что не буду!

— А баба твоя?

— Да не моя это баба!

— Лы-сы-й, пить будешь?!

Тут весь зал встает и скандирует:

— Лы-сы-й пей, Лы-сы-й пей!

* * *
Почему-то фраза: «Профессор завалил студента на экзамене» — звучит совершенно обыденно, а вот «Студент завалил профессора после экзамена» — вызывает бурную реакцию.

* * *
— Скажите, а ваша собака меня не съест?

— Да что вы, только понадкусывает.

* * *
Встреча заблудившегося туриста с русалкой приятна вдвойне: тут тебе и любовь, и уха!

* * *
Ружье, которое висит на сцене в первом акте, как известно, в русском театре в последнем акте выстрелит, а в индийском будет петь и танцевать. В других театрах оно будет:

— в немецком — маршировать;

— во французском — готовить;

— в итальянском — займется любовью;

— в турецком — что-нибудь построит;

— в польском — кому-то продаст Маршалковскую улицу в Варшаве;

— в еврейском — получит докторскую степень;

— в голландском — курнет;

— в испанском — предастся сиесте;

— в египетском — выклянчит чаевые.

* * *
Три заядлых автолюбителя в гараже после работы давят пузырь (кафе «карбюратор»). Вдруг подбегает семилетний сынишка одного из них:

— Папа! Там мальчишки во дворе обзываются непонятными словами!

–??

— Кто такие «пи…расы»?

Отец замешкался. На выручку приходит товарищ:

— Как тебе объяснить… Ну, вот, например, едет мужик по дороге по левому ряду, резко останавливается на перекрестке и включает левый поворот. Вот ЭТО и есть пи…рас.

Другой товарищ:

— Это что! Другое дело, если едет мужик по левому ряду, резко останавливается на перекрестке и включает ПРАВЫЙ поворот. Вот это уже точно пи…рас.

Отец:

— Это все фигня. Вот пример: Еду я по дороге, резко останавливаюсь на перекрестке, и забыл, куда мне дальше ехать — направо или налево. А эти ПИ…РАСЫ сзади сигналят, сигналят…

* * *
Стюардесса разносит напитки в летящем самолете. Подходит к англичанину:

— Что пить будете?

— Стаканчик виски.

Подходит к французу:

— Что пить будете?

— Бокал вина.

Подходит к смуглому мужику в тюрбане, замотанному в тряпки, непонятно как одетому:

— Что пить будете?

— Ничего. Мне через 15 минут за штурвал.

* * *
— Что такое наивность?

— Предположение о том, что русского человека от выпивки остановит отсутствие закуски.

* * *
Урок биологии. Никто не может правильно ответить. Куча двоек, только Вовочка сидит и тянет руку. Марья Ивановна с предчувствием, что тот скажет какую-нибудь гадость, спрашивает Вовочку. Вовочка встает, отвечает все точно по теме совершенно правильно. На следующем уроке повторяется все тоже самое. И так месяц. Очередной урок биологии, тема: Анатомия человека. Учительницу вызывают на совещание. Она:

— Что же делать? Урок пропадает! Вовочка, может ты проведешь?! Ты же все прекрасно последнее время отвечаешь!

— Конечно, Марь Ивановна!

Через полчаса училка входит в класс… Там все е…тся!

–??? Вовочка!!! Что это такое???

— Практические занятия.

— А почему Машенька у тебя х…й сосет?

— У доски отвечает.

— А почему Сидоров дрочит?

— У него самостоятельная работа.

— А Вася Петю в задницу имеет?

— А им один вариант попался.

* * *
Старый профессор на экзамене:

— Так, кто считает, что знает предмет на 5 баллов?

Подняло руки пара студентов. Профессор:

— Давайте зачетки.

И ставит отлично.

— Кто считает, что знает предмет на четыре балла?

Подняло руки человек десять. Тоже собирает зачетки, ставит четыре.

— Кто считает, что на 3?

Подняли руки — та же история.

— Значит, так — остальные неуд, приходите на пересдачу.

Студент:

— А когда пересдача?

Профессор:

— Ну-у-у, давайте сейчас. Итак, кто считает, что знает предмет на 5 баллов?…

* * *
Отдам хороший телефон в мобильные руки.

* * *
У здания собралась толпа и все смотрят вверх. На краю крыши стоит человек и собирается прыгнуть вниз. Вдруг у одной тетки не выдерживают нервы и она кричит:

— Да прыгай же, паразит, я на работу опаздываю!

* * *
Пистолет, как презерватив: никогда не знаешь, когда понадобится, но лучше, если всегда под рукой.

* * *
Новая SMS игра!

Отправьте на номер 7777 любое трехзначное число и найдите его в своем счете!

* * *
Cын «нового русского» спрашивает отца:

— Пап, кто такой Ньютон?

— Ну… это такой чувак в законе, у которого вся физика разложена по понятиям!

* * *
Мышка-сын спрашивает у мышки-папы:

— Па, а правда, что нас слоны боятся?

— Правда, сынок…

— А почему?

— Потому что мы банда!

* * *
Парень с девушкой лежат в кровати. Он:

— Я думаю, у нас это не любовь…

Она:

— Не любовь? А что?

Он:

— Ну… Легкий флирт.

Она (приподнимаясь на локте и внимательно смотря на него):

— Легкий флирт??? Два месяца в ж…у?

* * *
— Я ищу и буду искать множества приключений, волнений, переживаний, любовных историй! — выкрикивал в лицо своему отцу молодой человек, который собрался уйти из дома. — И не вздумай останавливать меня! Я выбрал свой путь в жизни!

— А кто тебя останавливает? — отвечает отец. — Только возьми и меня с собой!

* * *
— Мама, скажи, мой дедушка был проктологом?

— Твой дедушка был знаменитым проктологом!

— А папа тоже проктолог?

— Твой папа замечательный проктолог!

— А я, когда вырасту?…

— И ты, я уверена, станешь отличным проктологом!

— Но я хочу стать автомехаником!

— Вот еще! Хочешь всю жизнь в дерьме ковыряться?!

* * *
Заходит мужик в публичный дом и спрашивает:

— Мне девушку на часик.

— Извините, у нас все девушки заняты, но я могу предложить вам Гошу.

— Да нет, нет, я не голубой!!!

— Да вы не волнуйтесь, все кто брал Гошу оставались довольными.

— Ну ладно, давайте Гошу…

— Спускайтесь вниз, он вас будет в машине ждать.

Спускается мужик вниз, видит машина с мужчиной прилично одетым, садится и спрашивает:

— Это вы Гоша?

— Ну да…

— Тогда поехали!

Едут по Москве и попадают в огромную пробку. Мужик начинает уже нервничать.

— Эх, времени мало, пое…ться не успеем.

И только он это сказал, как Гоша вышел из машины, чего-то руками помахал — машины все поразъехались в разные стороны. Мужик — в недоумении. Проехали, едут дальше, и вдруг джип их подрезает и выходят три амбала.

— Ну попали, — говорит мужик.

Снова Гоша вышел, бандиты удивленно:

— Гоша, сколько лет, сколько зим! Здорово, друг. Извини, мы тебя не заметили. Вот тебе еще денег. Прости нас.

Поехали дальше, проезжают мимо Красной площади, и Гоша говорит:

— Останови здесь, мне тут выйти нужно.

Ну мужик останавливает машину, Гоша выходит, заходит в Госдуму. Охранники с улыбками провожают Гошу внутрь. Идет по коридору, ему Жириновский, Немцов, все на шею бросаются:

— Гоша, дружище, ну как жизнь?…

Идет дальше, и тут Путин выбегает без охраны, бросается на Гошу:

— Гоша, Гоша, где ты пропадал, почему не звонишь…

Мужик рот разинул, смотрит… Потом немного отошел, в себя пришел, вышел за дверь и набирает номер публичного дома.

— Алло, публичный дом.

— Да, здравствуйте, я у вас вот Гошу взял…

— Да, я помню, все в порядке? Вас все устраивает?

— Один вопрос. Он знает, кто кого е…ть будет?

* * *
— Ах, Пьер, вы даже не представляете себе, какое вы сокровище берете, — говорит женщина будущему зятю. — По вечерам не выходит, девственнее ангела, да простит мне Господь, книги да молитвы — единственное развлечение. А ее комната скромнее монашеской кельи, пойдемте заглянем.

Входят они в комнату и видят: стол, стул, кровать да больше ничего. Единственная экзотика — это клетка с попугаем. Попугай, увидев гостей, сразу встрепенулся и как прокричит:

–…Тр-ррр-ахай потише!!! Маман не спит!!!..

Пьер в шоке, мама в обморок падает, а попугай:

–…В жж-о-оопу, козел!!! Мне еще замуж выходить!..

* * *
Чукча подходит к проститутке на Тверской:

— Скока за ночь, однака?

Она смерила его взглядом:

— С тебя 150 баксов, лох.

Тут подскакивает чукотская братва и запихивает ее в багажник.

Прошло полгода… ее высаживают на том же месте, одичавшую, вонючую, в унтах и чукотских тряпках: в школе она училась плохо, откуда ей было знать, что ночь полярная.

* * *
Наши раллийные грузовики давно уже лучшие в мире! Вот еще бы научиться нам делать обычные…

* * *
Покупайте самовары фирмы «Тульский сюрприз»! Все покупатели самоваров получат по чайнику!

* * *
— Так… Больной, у вас рак и склероз.

— Ой! Слава богу! А то я боялся, что у меня рак.

* * *
Каждый программист знает — в правильном софте все должно быть прекрасно: и пользовательский интерфейс, и программные решения, и гениальные ошибки!

* * *
Как-то раз Берия говорит Сталину:

— Слушай, Сталин, давай в Москве назовем улицу именем Чайковского.

Сталин:

— Есть уже такая улыца — Нэ-Глынка.

* * *
Разговаривают двое «новых русских». Один огорчается:

— Вчера, блин, потерял сберкнижку!

— Ну, какие дела?! Новую заведешь!

— Да я еще ту не дочитал!

* * *
Сидят на лесной поляне волки — воют-рыдают! Подлетает ворона, на ветку села, спрашивает:

— Чего, серые, плачете?

— Да как тут не плакать, — всхлипывают волки. — Шапка Красная сериалов насмотрелась, по всему лесу растяжек понаставила! Теперь за какую веревочку ни дерни, либо башку снесет, либо ползада оторвет!

* * *'''.split('* * *')